app/views/events/_form.html.erb

SELECT "places".* FROM "places" ORDER BY "places"."name" ASC
---
      <%= form.label :name, "Event Venue" %>
      <%= form.collection_select :place_id, Place.order(:name),:id,:name %>