app/controllers/events_controller.rb

INSERT INTO "events" ("name", "start_date", "place_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Evento!!"], ["start_date", "2019-07-05"], ["place_id", 2], ["created_at", "2019-05-23 23:20:16.080382"], ["updated_at", "2019-05-23 23:20:16.080382"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "place_id" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["place_id", 1], ["updated_at", "2019-05-23 23:20:45.713053"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)