app/controllers/registrations_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "phone", "created_at", "updated_at", "encrypted_password") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
	    #complete this method
          new_user = User.new(registration_params)
          if new_user.save