app/controllers/tickets_controller.rb

  def create
    @event = Event.find(params[:event_id])
    @ticket = Ticket.new(ticket_params)
    @ticket.event = @event

    respond_to do |format|
      if @ticket.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tickets" ("price", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["price", 9999], ["event_id", 1], ["created_at", "2019-05-23 22:29:50.467159"], ["updated_at", "2019-05-23 22:29:50.467159"]]

  def update
    respond_to do |format|
      if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "price" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["price", 5001], ["updated_at", "2019-05-23 22:47:05.050340"], ["id", 3]]

  def destroy
    @ticket.destroy
---
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 19]]